{"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "int32", "sparse": false, "ragged": false, "name": "attention_mask"}, "name": "attention_mask", "inbound_nodes": []}, {"class_name": "BertLayer", "config": {"name": "bert_layer", "trainable": true, "dtype": "float32", "base_model": {"class_name": "TFBertModel", "config": {"return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": null, "use_bfloat16": false, "tf_legacy_loss": false, "pruned_heads": {}, "tie_word_embeddings": true, "chunk_size_feed_forward": 0, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "suppress_tokens": null, "begin_suppress_tokens": null, "architectures": ["BertModel"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1", "2": "LABEL_2", "3": "LABEL_3", "4": "LABEL_4"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1, "LABEL_2": 2, "LABEL_3": 3, "LABEL_4": 4}, "tokenizer_class": null, "prefix": null, "bos_token_id": null, "pad_token_id": 0, "eos_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "problem_type": null, "_name_or_path": "indobenchmark/indobert-base-p1", "_attn_implementation_autoset": false, "transformers_version": "4.47.1", "_num_labels": 5, "directionality": "bidi", "model_type": "bert", "output_past": true, "pooler_fc_size": 768, "pooler_num_attention_heads": 12, "pooler_num_fc_layers": 3, "pooler_size_per_head": 128, "pooler_type": "first_token_transform", "vocab_size": 50000, "hidden_size": 768, "num_hidden_layers": 12, "num_attention_heads": 12, "hidden_act": "gelu", "intermediate_size": 3072, "hidden_dropout_prob": 0.1, "attention_probs_dropout_prob": 0.1, "max_position_embeddings": 512, "type_vocab_size": 2, "initializer_range": 0.02, "layer_norm_eps": 1e-12, "position_embedding_type": "absolute", "use_cache": true, "classifier_dropout": null}, "__passive_serialization__": true}}, "name": "bert_layer", "inbound_nodes": [[["input_ids", 0, 0, {}], ["attention_mask", 0, 0, {}]]]}, {"class_name": "PoolerLayer", "config": {"name": "pooler_layer", "trainable": true, "dtype": "float32"}, "name": "pooler_layer", "inbound_nodes": [[["bert_layer", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_37", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_37", "inbound_nodes": [[["pooler_layer", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["dropout_37", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0], ["attention_mask", 0, 0]], "output_layers": [["dense", 0, 0]]}